################################################################################
#	REQUIRED
################################################################################
# Homebrew tabs
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Additional tools for brew-bundle
brew "mas" # https://github.com/mas-cli/mas
brew "whalebrew" # https://github.com/whalebrew/whalebrew


################################################################################
#	TOOLS
################################################################################
# asdf with it's requirements
brew "asdf"
brew "coreutils"
brew "gnupg"
brew "gpg"

brew "awscli"
brew "fzf"
brew "gh"
brew "git"
brew "git-bug"
brew "heroku/brew/heroku"
brew "htop"
brew "jq"
brew "lazygit"
brew "neovim"
brew "redis"
brew "ripgrep"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "tree"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "pgcli"
brew "pgweb"

brew "memcached"
brew "overmind"

cask "1password"
cask "alfred"
cask "raycast"
cask "apparition47/tap/mailtrackerblocker"
cask "appcleaner"
cask "chromedriver"
cask "contexts"
cask "dash"
cask "detectx-swift"
cask "docker"
cask "github"
cask "hammerspoon"
cask "hey"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "kindle"
cask "krisp"
cask "maestral" # Unofficial Dropbox client
cask "monitorcontrol"
cask "ngrok"
cask "notion"
cask "postman"
cask "telegram"
cask "termius"
cask "tuple"
cask "visual-studio-code"
cask "vlc"
cask "webtorrent"

tap "archivebox/archivebox"
brew "archivebox"

mas "Browserism for Chrome", id: 979047768
mas "Poolside FM", id: 1514817810
mas "Refined GitHub", id: 1519867270
mas "Slack", id: 803453959
mas "Userscripts", id: 1463298887
mas "LanguageTool - Grammar Checker", id: 1534275760
mas "ShellHistory", id: 1564015476
