################################################################################
#	REQUIRED
################################################################################
# Homebrew tabs
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Additional tools for brew-bundle
brew "mas" # https://github.com/mas-cli/mas
brew "whalebrew" # https://github.com/whalebrew/whalebrew


################################################################################
#	TOOLS
################################################################################
# asdf with it's requirements
brew "asdf"
brew "coreutils"
brew "gnupg"
brew "gpg"

brew "awscli"
brew "fzf"
brew "git"
brew "git-bug"
brew "heroku/brew/heroku"
brew "htop"
brew "lazygit"
brew "neovim"
brew "petere/postgresql/postgresql-common"
brew "redis"
brew "ripgrep"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "tree"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# cask "alfred" # Setapp
cask "1password-cli"
cask "appcleaner"
cask "contexts"
cask "dash"
cask "docker"
cask "firefox-developer-edition"
cask "hammerspoon"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "keycastr"
cask "krisp"
cask "loom"
cask "monitorcontrol"
cask "ngrok"
cask "notion"
cask "postman"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "webtorrent"
cask "zoom"

mas "1Password 7 - Password Manager", id: 1333542190
mas "Browserism for Chrome", id: 979047768
mas "Octotree Pro", id: 1457450145
mas "Poolside FM", id: 1514817810
mas "Slack", id: 803453959
mas "Userscripts", id: 1463298887
mas "Vimari", id: 1480933944
mas "WhatsApp Desktop", id: 1147396723

# Keep application settings in sync
# brew "mackup"

# cask "postgres" # Alternative: https://github.com/MaccaTech/PostgresPrefs
# cask "pgadmin4"
