tap "apparition47/tap"
tap "archivebox/archivebox"
tap "buildpacks/tap"
tap "charmbracelet/tap"
tap "danvergara/tools"
tap "elastic/tap"
tap "facebook/fb"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "hookdeck/hookdeck"
tap "ngrok/ngrok"
tap "puma/puma"
tap "romkatv/powerlevel10k"
tap "screenplaydev/tap"
tap "skatkov/tap"
tap "stripe/stripe-cli"
tap "teamtailor/elasticsearch-5.6"
brew "glib"
brew "pycparser"
brew "gmp"
brew "icu4c@76"
brew "openssl@3"
brew "aider"
brew "asdf"
brew "awscli"
brew "bat"
brew "bison"
brew "cargo-watch"
brew "cloudflared"
brew "libpq"
brew "libsodium"
brew "php"
brew "composer"
brew "coreutils"
brew "direnv"
brew "doctl"
brew "docutils"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "fd"
brew "fzf"
brew "fzy"
brew "gawk"
brew "gh"
brew "git"
brew "git-bug"
brew "git-filter-repo"
brew "gnu-sed"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "graphviz"
brew "pkgconf"
brew "guile"
brew "htop"
brew "shared-mime-info"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libgit2@1.7"
brew "llm"
brew "openjdk"
brew "ltex-ls"
brew "luajit"
brew "mas"
brew "maven"
brew "memcached"
brew "mysql"
brew "tree-sitter"
brew "neovim"
brew "nghttp2"
brew "node"
brew "node@20"
brew "openjdk@11"
brew "openapi-generator"
brew "opensearch"
brew "tmux"
brew "overmind"
brew "tree"
brew "pass"
brew "pgcli"
brew "pgweb"
brew "pinentry-mac"
brew "pipx"
brew "poppler"
brew "postgresql@16", restart_service: :changed, link: true
brew "powerlevel10k"
brew "psutils"
brew "python@3.9"
brew "re2c"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "s3cmd"
brew "sniffnet"
brew "tig"
brew "uv"
brew "vips"
brew "watchman"
brew "wget"
brew "whalebrew"
brew "yarn"
brew "zellij"
brew "zoxide"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "buildpacks/tap/pack"
brew "charmbracelet/tap/mods"
brew "facebook/fb/idb-companion"
brew "heroku/brew/heroku"
brew "hookdeck/hookdeck/hookdeck"
brew "puma/puma/puma-dev"
brew "screenplaydev/tap/graphite"
brew "skatkov/tap/poshtui"
brew "stripe/stripe-cli/stripe"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "applite"
cask "chromedriver"
cask "cloudflare-warp"
cask "contexts"
cask "dash"
cask "deskpad"
cask "detectx-swift"
cask "discord"
cask "docker"
cask "expo-orbit"
cask "firefox-developer-edition"
cask "ghostty"
cask "github"
cask "gitup"
cask "google-chrome-dev"
cask "graphiql"
cask "hammerspoon"
cask "hey"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keycastr"
cask "krisp"
cask "lagrange"
cask "loom"
cask "maestral"
cask "minisim"
cask "monitorcontrol"
cask "neohtop"
cask "ngrok"
cask "notion"
cask "postgres-unofficial"
cask "postman"
cask "raycast"
cask "react-native-debugger"
cask "safari-technology-preview"
cask "telegram"
cask "temurin"
cask "temurin11"
cask "termius"
cask "tuple"
cask "visual-studio-code"
cask "vlc"
cask "webtorrent"
cask "zen-browser"
whalebrew "directory"
vscode "aki77.rails-db-schema"
vscode "aki77.rails-routes"
vscode "aki77.rails-view-component"
vscode "arjun.swagger-viewer"
vscode "asciidoctor.asciidoctor-vscode"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "benspaulding.procfile"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.ruby-debug"
vscode "castwide.solargraph"
vscode "cognition.devin"
vscode "connorshea.vscode-ruby-test-adapter"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "expo.vscode-expo-tools"
vscode "first-try-software.ruby-flog"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-workspace"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gurgeous.ruby-open-gem"
vscode "hbenl.vscode-test-explorer"
vscode "itarato.byesig"
vscode "jemmyw.rails-fast-nav"
vscode "koichisasada.vscode-rdbg"
vscode "lottiefiles.vscode-lottie"
vscode "lourenci.go-to-spec"
vscode "mattpocock.ts-error-translator"
vscode "mhutchie.git-graph"
vscode "mindaro-dev.file-downloader"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "msjsdiag.vscode-react-native"
vscode "natqe.reload"
vscode "nixon.env-cmd-file-syntax"
vscode "noku.rails-run-spec-vscode"
vscode "phind.phind"
vscode "prisma.prisma"
vscode "rbuckton.deoptexplorer-vscode"
vscode "redhat.vscode-yaml"
vscode "ronnidc.nunjucks"
vscode "rpinski.shebang-snippets"
vscode "ryu1kn.partial-diff"
vscode "saoudrizwan.claude-dev"
vscode "shopify.ruby-lsp"
vscode "shopify.theme-check-vscode"
vscode "sianglim.slim"
vscode "simonsiefke.svg-preview"
vscode "sissel.shopify-liquid"
vscode "solomonkinard.git-blame"
vscode "sorbet.sorbet-vscode-extension"
vscode "stripe.vscode-stripe"
vscode "suchitadoshi1987.file-hopper"
vscode "sumneko.lua"
vscode "tavo.rails-schema"
vscode "testdouble.vscode-alternate-alternate-file"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "whtouche.vscode-js-console-utils"
vscode "yoavbls.pretty-ts-errors"
